### Pandas-DataFrame And Series 

Pandas is a Powerful data manipulation library in Python, widely used for data analysis and data cleaning. It provides two primary data structures: `Series` and `DataFrame` . A Series is a one-dimensional array-like object, while a DataFrame is a two-dimensional, size-mutable, and potentially heterogeneous tabular data structure with labeled axes (rows and columns).

In [2]:
import pandas as pd

In [3]:
## Series
## A Pandas seires is a one-dimensional array-like object that can hold any data type. It is similar to array

import pandas as pd

data=[1,2,3,4,5]
series=pd.Series(data)
print(" Series \n",series)

 Series
 0    1
1    2
2    3
3    4
4    5
dtype: int64

In [4]:
## Create a Series from dictionary

data={
    'a':1,
    'b':2,
    'c':3
}
series_dict=pd.Series(data)
print(series_dict)

a    1
b    2
c    3
dtype: int64

In [5]:
data=[10,20,30]
index=['a','b','c']
pd.Series(data,index=index)

a    10
b    20
c    30
dtype: int64

In [6]:
## DataFrame
## Create a dataframe from a dictionary of list

data={
    'Name':['Krish','John','Jack'],
    'Age':[25,30,45],
    'City':['Bangalore','New York','Florida']
}

df=pd.DataFrame(data)
print(df)
print(type(df))

    Name  Age       City
0  Krish   25  Bangalore
1   John   30   New York
2   Jack   45    Florida
<class 'pandas.core.frame.DataFrame'>

In [8]:
### Create a Data frame from a List of Dictionaries

data=[
    {'Name':'Krish','Age':32,'City':'Bangalore'},
    {'Name':'John','Age':25,'City':'New York'},
    {'Name':'Jack','Age':45,'City':'Florida'}
]

df=pd.DataFrame(data)
print(df)

    Name  Age       City
0  Krish   32  Bangalore
1   John   25   New York
2   Jack   45    Florida

In [9]:
df=pd.read_csv('data.csv')
print(df.head(5))

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North

In [10]:
print(df.tail(5))

          Date Category  Value   Product  Sales Region
45  2023-02-15        B   99.0  Product2  599.0   West
46  2023-02-16        B    6.0  Product1  938.0  South
47  2023-02-17        B   69.0  Product3  143.0   West
48  2023-02-18        C   65.0  Product3  182.0  North
49  2023-02-19        C   11.0  Product3  708.0  North

In [12]:
## Accessing Data from Dataframe
df['Product']

0     Product1
1     Product3
2     Product2
3     Product1
4     Product3
5     Product3
6     Product1
7     Product1
8     Product3
9     Product2
10    Product1
11    Product2
12    Product3
13    Product1
14    Product2
15    Product1
16    Product2
17    Product1
18    Product2
19    Product1
20    Product3
21    Product2
22    Product3
23    Product2
24    Product2
25    Product1
26    Product2
27    Product2
28    Product3
29    Product2
30    Product3
31    Product2
32    Product3
33    Product3
34    Product3
35    Product2
36    Product3
37    Product1
38    Product1
39    Product1
40    Product1
41    Product1
42    Product3
43    Product3
44    Product3
45    Product2
46    Product1
47    Product3
48    Product3
49    Product3
Name: Product, dtype: object

In [13]:
data=[
    {'Name':'Krish','Age':32,'City':'Bangalore'},
    {'Name':'John','Age':25,'City':'New York'},
    {'Name':'Jack','Age':45,'City':'Florida'}
]

df=pd.DataFrame(data)
print(df)

    Name  Age       City
0  Krish   32  Bangalore
1   John   25   New York
2   Jack   45    Florida

In [14]:
df

    Name  Age       City
0  Krish   32  Bangalore
1   John   25   New York
2   Jack   45    Florida

In [15]:
df['Name']

0    Krish
1     John
2     Jack
Name: Name, dtype: object

In [16]:
type(df['Name'])

pandas.core.series.Series

In [17]:
df.loc[0]

Name        Krish
Age            32
City    Bangalore
Name: 0, dtype: object

In [18]:
df.iloc[0]

Name        Krish
Age            32
City    Bangalore
Name: 0, dtype: object

In [21]:
df.loc[0][2]

/var/folders/91/f696bpjd7bd6zz_pg0q8xf740000gn/T/ipykernel_99383/2880214942.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.loc[0][2]

'Bangalore'

In [26]:
### Accessing a specified Element

print(df.at[1,'Age'])
print(df.at[2,'Age'])

25
45

In [27]:
df.at[2,'Name']

'Jack'

In [28]:
## Accessing a specified element using iat
df.iat[2,2]

'Florida'

In [29]:
### Data Manipulation with Data frame
df

    Name  Age       City
0  Krish   32  Bangalore
1   John   25   New York
2   Jack   45    Florida

In [30]:
## Adding a column
df['Salary']=[50000,60000,70000]

In [31]:
df

    Name  Age       City  Salary
0  Krish   32  Bangalore   50000
1   John   25   New York   60000
2   Jack   45    Florida   70000

In [34]:
## Removing a column
df.drop('Salary',axis=1) ## HEre axis means look into column

    Name  Age       City
0  Krish   32  Bangalore
1   John   25   New York
2   Jack   45    Florida

In [35]:
df

    Name  Age       City  Salary
0  Krish   32  Bangalore   50000
1   John   25   New York   60000
2   Jack   45    Florida   70000

## Explanation
The above code df.drop('Salary' , axis=1) isn't a permanent operations . So, In order to make it permanent save.

In [36]:
df.drop('Salary',axis=1, inplace=True )

In [37]:
df

    Name  Age       City
0  Krish   32  Bangalore
1   John   25   New York
2   Jack   45    Florida

In [38]:
## Add Age to the column

df['Age']=df['Age']+1
df

    Name  Age       City
0  Krish   33  Bangalore
1   John   26   New York
2   Jack   46    Florida

In [40]:
## Drop based on Rows
df.drop(0,inplace=True)

In [41]:
df

   Name  Age      City
1  John   26  New York
2  Jack   46   Florida

In [43]:
df=pd.read_csv('data.csv')
df.head(5)

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North

In [44]:
## Display the data types of each column
print("Data types: \n ", df.dtypes)

#Describe the DataFrame
print("Statistical summary: \n ", df.describe())

Data types:
  Date         object
Category     object
Value       float64
Product      object
Sales       float64
Region       object
dtype: object
Statistical summary:
             Value       Sales
count  47.000000   46.000000
mean   51.744681  557.130435
std    29.050532  274.598584
min     2.000000  108.000000
25%    27.500000  339.000000
50%    54.000000  591.500000
75%    70.000000  767.500000
max    99.000000  992.000000

In [45]:
df.describe()

           Value       Sales
count  47.000000   46.000000
mean   51.744681  557.130435
std    29.050532  274.598584
min     2.000000  108.000000
25%    27.500000  339.000000
50%    54.000000  591.500000
75%    70.000000  767.500000
max    99.000000  992.000000